; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l35_p35_c35_g35)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 refugio32 refugio33 refugio34 refugio35 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 person32 person33 person34 person35 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 comida)
	(at-box box19 deposito)
	(box-has box19 comida)
	(at-box box20 deposito)
	(box-has box20 comida)
	(at-box box21 deposito)
	(box-has box21 comida)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-box box32 deposito)
	(box-has box32 medicina)
	(at-box box33 deposito)
	(box-has box33 medicina)
	(at-box box34 deposito)
	(box-has box34 medicina)
	(at-box box35 deposito)
	(box-has box35 medicina)
	(at-person person1 refugio14)
	(at-person person2 refugio7)
	(at-person person3 refugio19)
	(at-person person4 refugio5)
	(at-person person5 refugio26)
	(at-person person6 refugio15)
	(at-person person7 refugio14)
	(at-person person8 refugio33)
	(at-person person9 refugio9)
	(at-person person10 refugio18)
	(at-person person11 refugio11)
	(at-person person12 refugio15)
	(at-person person13 refugio16)
	(at-person person14 refugio24)
	(at-person person15 refugio30)
	(at-person person16 refugio13)
	(at-person person17 refugio32)
	(at-person person18 refugio19)
	(at-person person19 refugio16)
	(at-person person20 refugio22)
	(at-person person21 refugio23)
	(at-person person22 refugio4)
	(at-person person23 refugio16)
	(at-person person24 refugio12)
	(at-person person25 refugio25)
	(at-person person26 refugio23)
	(at-person person27 refugio3)
	(at-person person28 refugio2)
	(at-person person29 refugio19)
	(at-person person30 refugio35)
	(at-person person31 refugio21)
	(at-person person32 refugio26)
	(at-person person33 refugio28)
	(at-person person34 refugio3)
	(at-person person35 refugio7)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 medicina)
	(person-has person10 comida)
	(person-has person11 medicina)
	(person-has person12 comida)
	(person-has person13 comida)
	(person-has person14 comida)
	(person-has person17 comida)
	(person-has person17 medicina)
	(person-has person18 comida)
	(person-has person19 comida)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person22 comida)
	(person-has person22 medicina)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person25 medicina)
	(person-has person26 comida)
	(person-has person27 comida)
	(person-has person29 comida)
	(person-has person32 medicina)
	(person-has person33 comida)
	(person-has person33 medicina)
	(person-has person34 comida)
	(person-has person34 medicina)
))
)

; plan
1. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 0 of 35
2. (pick box35 deposito dron1-izq dron1)
   deleted: (at-box box35 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box35)
   goals met: 0 of 35
3. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 0 of 35
4. (leave box35 refugio5 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box35) (box-has box35 medicina)
   added: (at-box box35 refugio5) (free dron1-izq) (person-has person4 medicina)
   goals met: 1 of 35
5. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 1 of 35
6. (pick box34 deposito dron1-izq dron1)
   deleted: (at-box box34 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box34)
   goals met: 1 of 35
7. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 1 of 35
8. (move refugio14 refugio33 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio33)
   goals met: 1 of 35
9. (leave box21 refugio33 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 comida)
   added: (at-box box21 refugio33) (free dron1-der) (person-has person8 comida)
   goals met: 2 of 35
10. (move refugio33 deposito dron1)
   deleted: (at-dron dron1 refugio33)
   added: (at-dron dron1 deposito)
   goals met: 2 of 35
11. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 2 of 35
12. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 2 of 35
13. (move refugio14 refugio9 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio9)
   goals met: 2 of 35
14. (leave box34 refugio9 dron1-izq dron1 person9 medicina)
   deleted: (carrying dron1 dron1-izq box34) (box-has box34 medicina)
   added: (at-box box34 refugio9) (free dron1-izq) (person-has person9 medicina)
   goals met: 3 of 35
15. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 3 of 35
16. (pick box33 deposito dron1-izq dron1)
   deleted: (at-box box33 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box33)
   goals met: 3 of 35
17. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 3 of 35
18. (move refugio14 refugio18 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio18)
   goals met: 3 of 35
19. (leave box20 refugio18 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 comida)
   added: (at-box box20 refugio18) (free dron1-der) (person-has person10 comida)
   goals met: 4 of 35
20. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 4 of 35
21. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 4 of 35
22. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 4 of 35
23. (move refugio14 refugio11 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio11)
   goals met: 4 of 35
24. (leave box33 refugio11 dron1-izq dron1 person11 medicina)
   deleted: (carrying dron1 dron1-izq box33) (box-has box33 medicina)
   added: (at-box box33 refugio11) (free dron1-izq) (person-has person11 medicina)
   goals met: 5 of 35
25. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 5 of 35
26. (pick box32 deposito dron1-izq dron1)
   deleted: (at-box box32 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box32)
   goals met: 5 of 35
27. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 5 of 35
28. (move refugio14 refugio24 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio24)
   goals met: 5 of 35
29. (leave box19 refugio24 dron1-der dron1 person14 comida)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 comida)
   added: (at-box box19 refugio24) (free dron1-der) (person-has person14 comida)
   goals met: 6 of 35
30. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 6 of 35
31. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 6 of 35
32. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 6 of 35
33. (move refugio14 refugio12 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio12)
   goals met: 6 of 35
34. (leave box18 refugio12 dron1-der dron1 person24 comida)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 comida)
   added: (at-box box18 refugio12) (free dron1-der) (person-has person24 comida)
   goals met: 7 of 35
35. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 7 of 35
36. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 7 of 35
37. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 7 of 35
38. (move refugio14 refugio25 dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 refugio25)
   goals met: 7 of 35
39. (leave box32 refugio25 dron1-izq dron1 person25 medicina)
   deleted: (carrying dron1 dron1-izq box32) (box-has box32 medicina)
   added: (at-box box32 refugio25) (free dron1-izq) (person-has person25 medicina)
   goals met: 8 of 35
40. (move refugio25 deposito dron1)
   deleted: (at-dron dron1 refugio25)
   added: (at-dron dron1 deposito)
   goals met: 8 of 35
41. (pick box31 deposito dron1-izq dron1)
   deleted: (at-box box31 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box31)
   goals met: 8 of 35
42. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 8 of 35
43. (leave box17 refugio14 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 comida)
   added: (at-box box17 refugio14) (free dron1-der) (person-has person1 comida)
   goals met: 9 of 35
44. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 9 of 35
45. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 9 of 35
46. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 9 of 35
47. (leave box31 refugio14 dron1-izq dron1 person1 medicina)
   deleted: (carrying dron1 dron1-izq box31) (box-has box31 medicina)
   added: (at-box box31 refugio14) (free dron1-izq) (person-has person1 medicina)
   goals met: 10 of 35
48. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 10 of 35
49. (pick box30 deposito dron1-izq dron1)
   deleted: (at-box box30 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box30)
   goals met: 10 of 35
50. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 10 of 35
51. (leave box16 refugio14 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 comida)
   added: (at-box box16 refugio14) (free dron1-der) (person-has person7 comida)
   goals met: 11 of 35
52. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 11 of 35
53. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 11 of 35
54. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 11 of 35
55. (leave box30 refugio14 dron1-izq dron1 person7 medicina)
   deleted: (carrying dron1 dron1-izq box30) (box-has box30 medicina)
   added: (at-box box30 refugio14) (free dron1-izq) (person-has person7 medicina)
   goals met: 12 of 35
56. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 12 of 35
57. (pick box29 deposito dron1-izq dron1)
   deleted: (at-box box29 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box29)
   goals met: 12 of 35
58. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 12 of 35
59. (leave box29 refugio15 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box29) (box-has box29 medicina)
   added: (at-box box29 refugio15) (free dron1-izq) (person-has person6 medicina)
   goals met: 13 of 35
60. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 13 of 35
61. (pick box28 deposito dron1-izq dron1)
   deleted: (at-box box28 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box28)
   goals met: 13 of 35
62. (move deposito refugio15 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio15)
   goals met: 13 of 35
63. (leave box15 refugio15 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 comida)
   added: (at-box box15 refugio15) (free dron1-der) (person-has person12 comida)
   goals met: 14 of 35
64. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 14 of 35
65. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 14 of 35
66. (move deposito refugio32 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio32)
   goals met: 14 of 35
67. (leave box14 refugio32 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 comida)
   added: (at-box box14 refugio32) (free dron1-der) (person-has person17 comida)
   goals met: 15 of 35
68. (move refugio32 deposito dron1)
   deleted: (at-dron dron1 refugio32)
   added: (at-dron dron1 deposito)
   goals met: 15 of 35
69. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 15 of 35
70. (move deposito refugio32 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio32)
   goals met: 15 of 35
71. (leave box28 refugio32 dron1-izq dron1 person17 medicina)
   deleted: (carrying dron1 dron1-izq box28) (box-has box28 medicina)
   added: (at-box box28 refugio32) (free dron1-izq) (person-has person17 medicina)
   goals met: 16 of 35
72. (move refugio32 deposito dron1)
   deleted: (at-dron dron1 refugio32)
   added: (at-dron dron1 deposito)
   goals met: 16 of 35
73. (pick box27 deposito dron1-izq dron1)
   deleted: (at-box box27 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box27)
   goals met: 16 of 35
74. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 16 of 35
75. (leave box13 refugio22 dron1-der dron1 person20 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio22) (free dron1-der) (person-has person20 comida)
   goals met: 17 of 35
76. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 17 of 35
77. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 17 of 35
78. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 17 of 35
79. (leave box27 refugio22 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box27) (box-has box27 medicina)
   added: (at-box box27 refugio22) (free dron1-izq) (person-has person20 medicina)
   goals met: 18 of 35
80. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 18 of 35
81. (pick box26 deposito dron1-izq dron1)
   deleted: (at-box box26 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box26)
   goals met: 18 of 35
82. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 18 of 35
83. (leave box12 refugio4 dron1-der dron1 person22 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio4) (free dron1-der) (person-has person22 comida)
   goals met: 19 of 35
84. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 19 of 35
85. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 19 of 35
86. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 19 of 35
87. (leave box26 refugio4 dron1-izq dron1 person22 medicina)
   deleted: (carrying dron1 dron1-izq box26) (box-has box26 medicina)
   added: (at-box box26 refugio4) (free dron1-izq) (person-has person22 medicina)
   goals met: 20 of 35
88. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 20 of 35
89. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 20 of 35
90. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 20 of 35
91. (leave box11 refugio16 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio16) (free dron1-der) (person-has person13 comida)
   goals met: 21 of 35
92. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 21 of 35
93. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 21 of 35
94. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 21 of 35
95. (leave box10 refugio16 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio16) (free dron1-der) (person-has person19 comida)
   goals met: 22 of 35
96. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 22 of 35
97. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 22 of 35
98. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 22 of 35
99. (leave box9 refugio16 dron1-der dron1 person23 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio16) (free dron1-der) (person-has person23 comida)
   goals met: 23 of 35
100. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 23 of 35
101. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 23 of 35
102. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 23 of 35
103. (leave box25 refugio16 dron1-izq dron1 person23 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio16) (free dron1-izq) (person-has person23 medicina)
   goals met: 24 of 35
104. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 24 of 35
105. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 24 of 35
106. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 24 of 35
107. (leave box8 refugio23 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio23) (free dron1-der) (person-has person21 comida)
   goals met: 25 of 35
108. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 25 of 35
109. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 25 of 35
110. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 25 of 35
111. (leave box7 refugio23 dron1-der dron1 person26 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio23) (free dron1-der) (person-has person26 comida)
   goals met: 26 of 35
112. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 26 of 35
113. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 26 of 35
114. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 26 of 35
115. (leave box6 refugio19 dron1-der dron1 person18 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio19) (free dron1-der) (person-has person18 comida)
   goals met: 27 of 35
116. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 27 of 35
117. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 27 of 35
118. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 27 of 35
119. (leave box5 refugio19 dron1-der dron1 person29 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio19) (free dron1-der) (person-has person29 comida)
   goals met: 28 of 35
120. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 28 of 35
121. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 28 of 35
122. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 28 of 35
123. (leave box4 refugio26 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio26) (free dron1-der) (person-has person5 comida)
   goals met: 29 of 35
124. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 29 of 35
125. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 29 of 35
126. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 29 of 35
127. (leave box24 refugio26 dron1-izq dron1 person32 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio26) (free dron1-izq) (person-has person32 medicina)
   goals met: 30 of 35
128. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 30 of 35
129. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 30 of 35
130. (move deposito refugio28 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio28)
   goals met: 30 of 35
131. (leave box3 refugio28 dron1-der dron1 person33 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio28) (free dron1-der) (person-has person33 comida)
   goals met: 31 of 35
132. (move refugio28 deposito dron1)
   deleted: (at-dron dron1 refugio28)
   added: (at-dron dron1 deposito)
   goals met: 31 of 35
133. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 31 of 35
134. (move deposito refugio28 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio28)
   goals met: 31 of 35
135. (leave box23 refugio28 dron1-izq dron1 person33 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio28) (free dron1-izq) (person-has person33 medicina)
   goals met: 32 of 35
136. (move refugio28 deposito dron1)
   deleted: (at-dron dron1 refugio28)
   added: (at-dron dron1 deposito)
   goals met: 32 of 35
137. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 32 of 35
138. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 32 of 35
139. (leave box22 refugio3 dron1-izq dron1 person34 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio3) (free dron1-izq) (person-has person34 medicina)
   goals met: 33 of 35
140. (leave box2 refugio3 dron1-der dron1 person27 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio3) (free dron1-der) (person-has person27 comida)
   goals met: 34 of 35
141. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 34 of 35
142. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 34 of 35
143. (move deposito refugio3 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio3)
   goals met: 34 of 35
144. (leave box1 refugio3 dron1-der dron1 person34 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio3) (free dron1-der) (person-has person34 comida)
   goals met: 35 of 35
